Revit 2024 API
DuctFittingAndAccessoryData Class
 The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class DuctFittingAndAccessoryData : IDisposable
Visual Basic
Public Class DuctFittingAndAccessoryData _
	Implements IDisposable
Visual C++
public ref class DuctFittingAndAccessoryData : IDisposable
Remarks
 A FamilyInstance is the input data for the calculation,
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData
See Also
DuctFittingAndAccessoryData Members
Autodesk.Revit.DB.Mechanical Namespace